Revit 2027 API
BuiltInFailures.LinkFailures.DuplicateLinks Property
 Multiple Linked Files have the same name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DuplicateLinks { get; }
Public Shared ReadOnly Property DuplicateLinks As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DuplicateLinks {
	FailureDefinitionId^ get ();
}
static member DuplicateLinks : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace